# Core
brew "git"
brew "curl"
brew "wget"

# Build tools
brew "pkg-config"

# CLI
brew "tmux"
brew "jq"
brew "yq"
brew "ripgrep"
brew "fzf"
brew "direnv"
brew "fd"
brew "bat"
brew "tree"
brew "zip"
brew "unzip"
brew "shellcheck"
brew "shfmt"
brew "gnupg"
brew "pinentry-mac"

# Code hosting CLIs
# Authenticate with `gh auth login` after install; this file must not run it.
# Additional Git hosting CLIs can be installed separately on machines that
# need them.
brew "gh"
